{"uid": "L6", "total": "20", "questions": ["{\"py/object\": \"helper.questionhelper.Question\", \"qid\": 0, \"marks\": \"8\", \"qText\": \"Read all the files from csse_covid_19_daily_reports_us folder in largedatasets folder. <br> Create a DataFrame with the name deathCumulativeTotal containing four columns (Date, New York, Texas, California). <br>\\nThe Date column should contain all the dates (Date column in the file) ordered in an ascending fashion and the other three columns should contain the cumulative total of Deaths (the Deaths column) for the three states with respect to time.<br>\\nNow create a plot with the cumulative distribution of Covid-19 Deaths for the three states with respect to Date.<br> Save the plot with the name cumulative_deaths.png to the current directory. Provide appropriate title, and labels for x and y axis.  \", \"qType\": \"4\", \"qImageDetails\": null, \"results\": {\"options\": null, \"choice\": \"#Type your code below.\\n\"}}", "{\"py/object\": \"helper.questionhelper.Question\", \"qid\": 1, \"marks\": \"12\", \"qText\": \"Read the file oh_hospital_utilization utilization from the folder oh_hospital_utilization  in the largedatasets folder. <br>\\nNow select three hospitals 'UH CLEVELAND MEDICAL CENTER', 'CLEVELAND CLINIC', and 'METROHEALTH MEDICAL CENTER' and store it in a DataFrame called threeHospitals with only four columns collection_week, hospital_name, inpatient_beds_used_7_day_sum, and inpatient_beds_used_covid_7_day_sum. <br>\\nNow create a new column in the threeHospitals DataFrame called covid_bed_utilization which is the ratio between inpatient_beds_used_covid_7_day_sum and inpatient_beds_used_7_day_sum multiplied by 100. <br> Now transform/pivot your dataset so that the indexes will be the collection_week, and the columns will be the three hospitals and the corresponding values will be covid_bed_utilization. Plot the line graph for the three hospitals together and save it with a filename hospital_utilization.png in the current directory. <br> Provide appropriate title and axis labels.  \", \"qType\": \"4\", \"qImageDetails\": null, \"results\": {\"options\": null, \"choice\": \"#Type your code below.\\n\"}}"]}