{"uid": "Exam2", "total": "25", "questions": ["{\"py/object\": \"helper.questionhelper.Question\", \"qid\": 0, \"marks\": \"5\", \"qText\": \"Create a choropleth map of SVI for the census tracts in NYC (nyc_census_tracts, us_tract_svi), also create a map of homicides for the census tracts (nyc_homicides). Use red color scheme and equal interval classification.\", \"qType\": \"4\", \"qImageDetails\": null, \"results\": {\"options\": null, \"choice\": null}}", "{\"py/object\": \"helper.questionhelper.Question\", \"qid\": 1, \"marks\": \"10\", \"qText\": \"From the large datasets folder, open the skilled_nursing_cle folder and then the skilled_nursing_cle.csv file. Use the Cuyahoga voters data in misc database (cuy_voters) and Cleveland boundaries to find out the voters in Cleveland. Find out the total percentage of people with age 60 or above within 50 meter of each of the skilled nursing facilities. Find out the facilities that have less than 50% population below the 60 or above category with in the 50-meter radius.\", \"qType\": \"4\", \"qImageDetails\": null, \"results\": {\"options\": null, \"choice\": null}}", "{\"py/object\": \"helper.questionhelper.Question\", \"qid\": 2, \"marks\": \"6\", \"qText\": \"Create a choropleth map of monthly covid change for the various census tracts in Cleveland. The covid data is available in \\u201cmisc\\u201d database with the name covid_data. The Cleveland boundaries are also provided in the misc database  as well as the census tracts for entire usa (us_tracts). For example if you are starting your covid change map from May 2020, then you don\\u2019t need to create a change map for the first month. Then for the month of June 2020 you will calculate the total for May and the total for June 2020 and then calculate the difference and plot the tracts map. You will use natural breaks scheme with a diverging color ramp from green_yellow_red.\", \"qType\": \"4\", \"qImageDetails\": null, \"results\": {\"options\": null, \"choice\": null}}", "{\"py/object\": \"helper.questionhelper.Question\", \"qid\": 3, \"marks\": \"4\", \"qText\": \"Create a choropleth map of percentage of people over 65 for the various census tracts in Cleveland using the Cuyahoga voters data. The color scheme should be reds and you can use any classification scheme that suits the data. \", \"qType\": \"4\", \"qImageDetails\": null, \"results\": {\"options\": null, \"choice\": null}}"]}